In [3]:
import pandas as pd
data= {'country':['Belgium','France','Germany','Netherlands','UK'],
      'population':[11.3,64.3,81.3,16.9,64.9],
      'area':[30510,671308,357050,41256,244820],
      'capital':['Brussels','Paris','Berlin','Amsterdam','London']}

In [4]:
#create a dataframe
countries=pd.DataFrame(data)
countries.head()

       country  population    area    capital
0      Belgium        11.3   30510   Brussels
1       France        64.3  671308      Paris
2      Germany        81.3  357050     Berlin
3  Netherlands        16.9   41256  Amsterdam
4           UK        64.9  244820     London

In [6]:
#print only population
population= countries['population']
population

0    11.3
1    64.3
2    81.3
3    16.9
4    64.9
Name: population, dtype: float64

In [7]:
#multiply the population with 1000
population * 1000

0    11300.0
1    64300.0
2    81300.0
3    16900.0
4    64900.0
Name: population, dtype: float64

In [8]:
population>50

0    False
1     True
2     True
3    False
4     True
Name: population, dtype: bool

In [9]:
population/countries['area']

0    0.000370
1    0.000096
2    0.000228
3    0.000410
4    0.000265
dtype: float64

In [10]:
#added in your data frame as new column
countries['population_density']= population/countries['area'] * 1e6

In [11]:
countries

       country  population    area    capital  population_density
0      Belgium        11.3   30510   Brussels          370.370370
1       France        64.3  671308      Paris           95.783158
2      Germany        81.3  357050     Berlin          227.699202
3  Netherlands        16.9   41256  Amsterdam          409.637386
4           UK        64.9  244820     London          265.092721

In [12]:
#Average Population
population.mean()

47.739999999999995

In [13]:
#get minimum area:
countries['area'].min()

30510

In [15]:
#Dataframe we get a series of one values for each column
#if you have mixed type of Data and you want to calculatre the median of numerics columns
countries.median(numeric_only=True)

population                64.300000
area                  244820.000000
population_density       265.092721
dtype: float64